
#seasons = {'winter' : ('12','1', '2'), 'spring' : ('3', '4', '5'), 'summer' : ('6', '7', '8'),
#           'autumn' : ('9', '10', '11')}
#не смогла сделать вывод ключа по значению, пожалуйста покажите как это можно было сделать


val = input('введите номер месяца: ')

my_dict = {'1' : 'зима','2' : 'зима','3' : 'весна','4' : 'весна','5' : 'весна','6' : 'лето',
'7' : 'лето','8' : 'лето','9' : 'осень','10' : 'осень','11' : 'осень','12' : 'зима' }

winter = ['12', '1', '2']
spring = ['3', '4', '5']
summer = ['6', '7', '8']
autumn = ['9', '10', '11']


try:
    print(my_dict[val])

    if val in winter:
        print('зима')
    elif val in spring:
        print('весна')
    elif val in summer:
        print('лето')
    else:
        print('осень')
except KeyError:
    print('некорректные данные')








